export default {
	/**
	 * 随机生成网名
	 */
	handle() {
		var nickNameAttr = ["男人伤心不流泪", "Ｖip▃__和尚", "Ｖip▃__尼姑", "那一夜丶床摇得很厉害", "悟空好性感，豹纹加钢管", "你若安好、便是老天瞎了眼",
			"該用戶太懶還沒想好網名",
			"泡8喝9說10話", "小姐ヽ我是妳惹不起的草°", "男人不能慣越慣越完蛋", "專註人渣20年", "鬧夠了就去吃藥", "分手后的思念是犯贱", "硪的偶像是女汉纸i", "安安稳稳 ヽ",
			"姑娘我疯疯癫颠有理想i", "有你任性.", "我一直都在、", "孤独、也是一种态度゜", "ヅ奈何桥上唱小苹果う", "孟婆！来杯优乐美", "- 胸大无脑鸡大闷骚。", "内裤在美＿终究只能装逼",
			"扯着俩个蛋四处跑骚≠", "酒入悠肠化作姨妈更护花丶", "抬着大炮轰学校°", "宁死被窝不死书桌、", "脚踏两只船丶划得更快", "小猛男", "小淑女", "做最开心的自己", "我爱你胜过爱自己",
			"善良是我本性@", "逆境荒野", "我不愿将就！", "人总是要为自己活", "捧花为你", "我为你代言", "想我所想ひ", "為人民服務", "守心奴i", "难免任性@", "我有多倔强就有多坚强.",
			"愛の過祛", "师太,求你别抽老衲脸", "尼古丁有У1n。╮", "呼吸的余溫很暖。", "日暮途穷￠", "死咣咣", "若隐若现ヽ", "男人为何虚情假意﹌", "温柔的(放肆)", "锁魂Fu2Ⅳ_×",
			"卟再绶鉨诱惑", "__演（自己。", "梦里寻她千百度″", "温柔的败退〃", "蠢蠢欲动", "用心温暖了彼此", "阴霾里的浅唱", "玍亽伆近", "漃莫(加)倍", "平淡Wu 奇╮", "韩小熙り",
			"喂、别丢下我", "hu-a、开场。", "那放肆的青春ˇ", "一梦三四年≈"
		];
		var index = parseInt(Math.random() * nickNameAttr.length - 1);
		return nickNameAttr[index];
	}
}
